-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Máy chủ: 127.0.0.1
-- Thời gian đã tạo: Th4 06, 2026 lúc 04:00 PM
-- Phiên bản máy phục vụ: 10.4.28-MariaDB
-- Phiên bản PHP: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Cơ sở dữ liệu: `exam_online`
--

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `bai_lam`
--

CREATE TABLE `bai_lam` (
  `maBL` bigint(20) UNSIGNED NOT NULL,
  `maDT` bigint(20) UNSIGNED NOT NULL,
  `maTK` bigint(20) UNSIGNED NOT NULL,
  `maKQT` bigint(20) UNSIGNED DEFAULT NULL,
  `trangThai` enum('Đã hoàn thành','Chưa hoàn thành') NOT NULL DEFAULT 'Chưa hoàn thành',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `bai_lam`
--

INSERT INTO `bai_lam` (`maBL`, `maDT`, `maTK`, `maKQT`, `trangThai`, `created_at`, `updated_at`) VALUES
(1, 2, 5, 1, 'Đã hoàn thành', '2025-07-10 07:00:00', '2025-07-10 07:00:00'),
(2, 2, 6, 2, 'Đã hoàn thành', '2025-07-10 07:00:00', '2025-07-10 07:00:00');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `cache`
--

CREATE TABLE `cache` (
  `key` varchar(255) NOT NULL,
  `value` mediumtext NOT NULL,
  `expiration` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `cache_locks`
--

CREATE TABLE `cache_locks` (
  `key` varchar(255) NOT NULL,
  `owner` varchar(255) NOT NULL,
  `expiration` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `cau_hoi`
--

CREATE TABLE `cau_hoi` (
  `maCH` bigint(20) UNSIGNED NOT NULL,
  `noiDung` text NOT NULL,
  `dapAnA` text NOT NULL,
  `dapAnB` text NOT NULL,
  `dapAnC` text NOT NULL,
  `dapAnD` text NOT NULL,
  `dapAnDung` enum('A','B','C','D') NOT NULL,
  `doKho` enum('Dễ','Trung Bình','Khó') NOT NULL,
  `ngayTao` datetime DEFAULT NULL,
  `maNguoiTao` bigint(20) UNSIGNED NOT NULL,
  `maMonHoc` bigint(20) UNSIGNED NOT NULL,
  `maChuong` bigint(20) UNSIGNED DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `cau_hoi`
--

INSERT INTO `cau_hoi` (`maCH`, `noiDung`, `dapAnA`, `dapAnB`, `dapAnC`, `dapAnD`, `dapAnDung`, `doKho`, `ngayTao`, `maNguoiTao`, `maMonHoc`, `maChuong`, `created_at`, `updated_at`) VALUES
(1, 'Cơ sở dữ liệu là gì?', 'Tập hợp dữ liệu liên quan', 'Ngôn ngữ lập trình', 'Hệ điều hành', 'Trình duyệt', 'A', 'Dễ', '2025-07-07 00:49:28', 2, 1, 1, '2025-07-06 17:49:28', '2025-07-06 17:49:28'),
(2, 'Hệ quản trị cơ sở dữ liệu (DBMS) là gì?', 'Hệ điều hành', 'Phần mềm quản lý CSDL', 'Trình duyệt', 'Biên dịch', 'B', 'Dễ', '2025-07-07 00:49:28', 2, 1, 1, '2025-07-06 17:49:28', '2025-07-06 17:49:28'),
(3, 'Đặc điểm chính của cơ sở dữ liệu?', 'Truy cập đồng thời', 'Không lưu trữ dữ liệu', 'Chỉ đọc dữ liệu', 'Không có ràng buộc', 'A', 'Trung Bình', '2025-07-07 00:49:28', 2, 1, 1, '2025-07-06 17:49:28', '2025-07-06 17:49:28'),
(4, 'Ví dụ của hệ quản trị CSDL?', 'MS Word', 'MySQL', 'Photoshop', 'Chrome', 'B', 'Dễ', '2025-07-07 00:49:28', 2, 1, 1, '2025-07-06 17:49:28', '2025-07-06 17:49:28'),
(5, 'CSDL giúp gì?', 'Lưu trữ và quản lý dữ liệu', 'Soạn thảo văn bản', 'Vẽ đồ họa', 'Lướt web', 'A', 'Dễ', '2025-07-07 00:49:28', 2, 1, 1, '2025-07-06 17:49:28', '2025-07-06 17:49:28'),
(6, 'Tính toàn vẹn dữ liệu là?', 'Giữ dữ liệu đúng đắn', 'Xóa dữ liệu', 'Chia sẻ file', 'In tài liệu', 'A', 'Trung Bình', '2025-07-07 00:49:28', 2, 1, 1, '2025-07-06 17:49:28', '2025-07-06 17:49:28'),
(7, 'CSDL phân tán là?', 'Dữ liệu nằm nhiều nơi', 'Dữ liệu 1 file', 'Dữ liệu không truy cập', 'Dữ liệu không chia sẻ', 'A', 'Khó', '2025-07-07 00:49:28', 2, 1, 1, '2025-07-06 17:49:28', '2025-07-06 17:49:28'),
(8, 'Tập tin dữ liệu là gì?', 'Dữ liệu lưu rải rác', 'Dữ liệu lưu có cấu trúc', 'Không lưu dữ liệu', 'Không truy xuất được', 'B', 'Trung Bình', '2025-07-07 00:49:28', 2, 1, 1, '2025-07-06 17:49:28', '2025-07-06 17:49:28'),
(9, 'Ứng dụng nào sử dụng CSDL?', 'Hệ thống quản lý thư viện', 'Paint', 'Notepad', 'Trình duyệt', 'A', 'Trung Bình', '2025-07-07 00:49:28', 2, 1, 1, '2025-07-06 17:49:28', '2025-07-06 17:49:28'),
(10, 'CSDL thường lưu dữ liệu dạng?', 'File văn bản', 'File ảnh', 'Bảng dữ liệu', 'Video', 'C', 'Khó', '2025-07-07 00:49:28', 2, 1, 1, '2025-07-06 17:49:28', '2025-07-06 17:49:28'),
(11, 'Mô hình dữ liệu nào phổ biến nhất?', 'Phân cấp', 'Mạng', 'Quan hệ', 'Đối tượng', 'C', 'Trung Bình', '2025-07-07 00:50:16', 2, 1, 2, '2025-07-06 17:50:16', '2025-07-06 17:50:16'),
(12, 'Mô hình quan hệ lưu dữ liệu dạng?', 'Bảng', 'Cây', 'Danh sách', 'Đồ thị', 'A', 'Dễ', '2025-07-07 00:50:16', 2, 1, 2, '2025-07-06 17:50:16', '2025-07-06 17:50:16'),
(13, 'Mô hình dữ liệu có thành phần gì?', 'Cấu trúc, ràng buộc, thao tác', 'Cấu trúc', 'Thao tác', 'Ràng buộc', 'A', 'Trung Bình', '2025-07-07 00:50:16', 2, 1, 2, '2025-07-06 17:50:16', '2025-07-06 17:50:16'),
(14, 'Mô hình phân cấp dữ liệu tổ chức dạng?', 'Cây', 'Bảng', 'Đồ thị', 'Danh sách', 'A', 'Khó', '2025-07-07 00:50:16', 2, 1, 2, '2025-07-06 17:50:16', '2025-07-06 17:50:16'),
(15, 'Mô hình mạng có đặc điểm gì?', 'Nhiều quan hệ phức tạp', 'Chỉ 1 quan hệ', 'Không quan hệ', 'Quan hệ 1-1', 'A', 'Khó', '2025-07-07 00:50:16', 2, 1, 2, '2025-07-06 17:50:16', '2025-07-06 17:50:16'),
(16, 'Quan hệ 1-n là?', 'Một bản ghi liên kết nhiều bản ghi', 'Một bản ghi chỉ 1 liên kết', 'Không liên kết', 'Liên kết toàn bộ', 'A', 'Dễ', '2025-07-07 00:50:16', 2, 1, 2, '2025-07-06 17:50:16', '2025-07-06 17:50:16'),
(17, 'Quan hệ n-n là?', 'Nhiều liên kết nhiều', 'Không liên kết', 'Chỉ 1 liên kết', 'Liên kết 1 chiều', 'A', 'Trung Bình', '2025-07-07 00:50:16', 2, 1, 2, '2025-07-06 17:50:16', '2025-07-06 17:50:16'),
(18, 'Dữ liệu trong mô hình quan hệ gọi là?', 'Thuộc tính', 'Bản ghi', 'Trường', 'Cột', 'B', 'Dễ', '2025-07-07 00:50:16', 2, 1, 2, '2025-07-06 17:50:16', '2025-07-06 17:50:16'),
(19, 'Mô hình dữ liệu quyết định?', 'Cách lưu và xử lý dữ liệu', 'Màu giao diện', 'Hệ điều hành', 'Trình duyệt', 'A', 'Dễ', '2025-07-07 00:50:16', 2, 1, 2, '2025-07-06 17:50:16', '2025-07-06 17:50:16'),
(20, 'Khóa chính là?', 'Xác định duy nhất bản ghi', 'Dữ liệu trùng nhau', 'Dữ liệu rỗng', 'Dữ liệu tạm', 'A', 'Trung Bình', '2025-07-07 00:50:16', 2, 1, 2, '2025-07-06 17:50:16', '2025-07-06 17:50:16'),
(21, 'SQL là gì?', 'Ngôn ngữ truy vấn', 'Ngôn ngữ lập trình', 'Phần mềm', 'Hệ điều hành', 'A', 'Dễ', '2025-07-07 00:50:47', 2, 1, 3, '2025-07-06 17:50:47', '2025-07-06 17:50:47'),
(22, 'Lệnh SELECT dùng để?', 'Chèn dữ liệu', 'Truy vấn dữ liệu', 'Xóa dữ liệu', 'Cập nhật dữ liệu', 'B', 'Dễ', '2025-07-07 00:50:47', 2, 1, 3, '2025-07-06 17:50:47', '2025-07-06 17:50:47'),
(23, 'Lệnh INSERT dùng để?', 'Chèn dữ liệu', 'Xóa dữ liệu', 'Truy vấn dữ liệu', 'Cập nhật dữ liệu', 'A', 'Dễ', '2025-07-07 00:50:47', 2, 1, 3, '2025-07-06 17:50:47', '2025-07-06 17:50:47'),
(24, 'Lệnh DELETE dùng để?', 'Chèn dữ liệu', 'Xóa dữ liệu', 'Truy vấn dữ liệu', 'Cập nhật dữ liệu', 'B', 'Dễ', '2025-07-07 00:50:47', 2, 1, 3, '2025-07-06 17:50:47', '2025-07-06 17:50:47'),
(25, 'Lệnh UPDATE dùng để?', 'Cập nhật dữ liệu', 'Xóa dữ liệu', 'Chèn dữ liệu', 'Truy vấn dữ liệu', 'A', 'Trung Bình', '2025-07-07 00:50:47', 2, 1, 3, '2025-07-06 17:50:47', '2025-07-06 17:50:47'),
(26, 'DDL là gì?', 'Ngôn ngữ định nghĩa dữ liệu', 'Ngôn ngữ thao tác dữ liệu', 'Ngôn ngữ lập trình', 'Ngôn ngữ báo cáo', 'A', 'Khó', '2025-07-07 00:50:47', 2, 1, 3, '2025-07-06 17:50:47', '2025-07-06 17:50:47'),
(27, 'DML là gì?', 'Ngôn ngữ thao tác dữ liệu', 'Ngôn ngữ định nghĩa dữ liệu', 'Ngôn ngữ lập trình', 'Ngôn ngữ báo cáo', 'A', 'Khó', '2025-07-07 00:50:47', 2, 1, 3, '2025-07-06 17:50:47', '2025-07-06 17:50:47'),
(28, 'Câu lệnh tạo bảng?', 'CREATE TABLE', 'INSERT INTO', 'SELECT *', 'DELETE', 'A', 'Trung Bình', '2025-07-07 00:50:47', 2, 1, 3, '2025-07-06 17:50:47', '2025-07-06 17:50:47'),
(29, 'Câu lệnh xóa bảng?', 'DROP TABLE', 'DELETE', 'UPDATE', 'INSERT', 'A', 'Trung Bình', '2025-07-07 00:50:47', 2, 1, 3, '2025-07-06 17:50:47', '2025-07-06 17:50:47'),
(30, 'Câu lệnh thêm cột?', 'ALTER TABLE', 'SELECT', 'DROP', 'UPDATE', 'A', 'Trung Bình', '2025-07-07 00:50:47', 2, 1, 3, '2025-07-06 17:50:47', '2025-07-06 17:50:47'),
(31, 'Thiết kế cơ sở dữ liệu gồm mấy bước chính?', '3', '4', '5', '6', 'C', 'Dễ', '2025-07-07 00:52:04', 2, 1, 4, '2025-07-06 17:52:04', '2025-07-06 17:52:04'),
(32, 'Thiết kế lôgic nghĩa là?', 'Thiết kế bảng và quan hệ', 'Thiết kế giao diện', 'Thiết kế mạng', 'Thiết kế phần cứng', 'A', 'Trung Bình', '2025-07-07 00:52:04', 2, 1, 4, '2025-07-06 17:52:04', '2025-07-06 17:52:04'),
(33, 'Mục tiêu của thiết kế cơ sở dữ liệu?', 'Hiệu quả và toàn vẹn dữ liệu', 'Giao diện đẹp', 'Dữ liệu nhỏ gọn', 'Nhanh tải web', 'A', 'Trung Bình', '2025-07-07 00:52:04', 2, 1, 4, '2025-07-06 17:52:04', '2025-07-06 17:52:04'),
(34, 'Thiết kế vật lý là?', 'Thiết kế lưu trữ thực tế', 'Thiết kế màn hình', 'Thiết kế biểu mẫu', 'Thiết kế sơ đồ', 'A', 'Trung Bình', '2025-07-07 00:52:04', 2, 1, 4, '2025-07-06 17:52:04', '2025-07-06 17:52:04'),
(35, 'Chuẩn hóa dữ liệu nhằm?', 'Tránh dư thừa', 'Tăng tốc độ nhập', 'Tăng dung lượng', 'Tạo báo cáo nhanh', 'A', 'Trung Bình', '2025-07-07 00:52:04', 2, 1, 4, '2025-07-06 17:52:04', '2025-07-06 17:52:04'),
(36, 'Quan hệ 1-1 thể hiện?', 'Mỗi bản ghi A gắn 1 bản ghi B', 'Nhiều A gắn nhiều B', 'Không gắn kết', 'Tất cả sai', 'A', 'Dễ', '2025-07-07 00:52:04', 2, 1, 4, '2025-07-06 17:52:04', '2025-07-06 17:52:04'),
(37, 'Quan hệ 1-n thể hiện?', 'Một A nhiều B', 'Một A một B', 'Một A không B', 'Nhiều A nhiều B', 'A', 'Dễ', '2025-07-07 00:52:04', 2, 1, 4, '2025-07-06 17:52:04', '2025-07-06 17:52:04'),
(38, 'Quan hệ n-n thể hiện?', 'Nhiều A nhiều B', 'Một A một B', 'Không liên kết', 'Một A nhiều B', 'A', 'Dễ', '2025-07-07 00:52:04', 2, 1, 4, '2025-07-06 17:52:04', '2025-07-06 17:52:04'),
(39, 'Chuẩn 1NF yêu cầu?', 'Không lặp nhóm', 'Không khóa chính', 'Không quan hệ', 'Không thuộc tính', 'A', 'Khó', '2025-07-07 00:52:04', 2, 1, 4, '2025-07-06 17:52:04', '2025-07-06 17:52:04'),
(40, 'Chuẩn 2NF yêu cầu?', 'Thuộc tính không phụ thuộc 1 phần', 'Không có quan hệ', 'Không có bảng', 'Không có thuộc tính', 'A', 'Khó', '2025-07-07 00:52:04', 2, 1, 4, '2025-07-06 17:52:04', '2025-07-06 17:52:04'),
(41, 'Quản trị cơ sở dữ liệu gồm?', 'Sao lưu, bảo mật, tối ưu', 'Vẽ sơ đồ', 'Tạo website', 'Tạo file văn bản', 'A', 'Trung Bình', '2025-07-07 00:52:20', 2, 1, 5, '2025-07-06 17:52:20', '2025-07-06 17:52:20'),
(42, 'Sao lưu dữ liệu để?', 'Phục hồi khi lỗi', 'Tăng tốc', 'Giảm dung lượng', 'Chia sẻ nhanh', 'A', 'Dễ', '2025-07-07 00:52:20', 2, 1, 5, '2025-07-06 17:52:20', '2025-07-06 17:52:20'),
(43, 'Bảo mật dữ liệu để?', 'Ngăn truy cập trái phép', 'Tăng tốc', 'Giảm dung lượng', 'Tạo báo cáo', 'A', 'Dễ', '2025-07-07 00:52:20', 2, 1, 5, '2025-07-06 17:52:20', '2025-07-06 17:52:20'),
(44, 'Tối ưu truy vấn để?', 'Tăng hiệu năng', 'Giảm bảo mật', 'Tăng dung lượng', 'Tạo báo cáo', 'A', 'Trung Bình', '2025-07-07 00:52:20', 2, 1, 5, '2025-07-06 17:52:20', '2025-07-06 17:52:20'),
(45, 'Người quản trị CSDL là?', 'DBA', 'CEO', 'CIO', 'CTO', 'A', 'Dễ', '2025-07-07 00:52:20', 2, 1, 5, '2025-07-06 17:52:20', '2025-07-06 17:52:20'),
(46, 'Phân quyền trong CSDL để?', 'Giới hạn quyền truy cập', 'Tăng tốc', 'Giảm dung lượng', 'Tạo báo cáo', 'A', 'Trung Bình', '2025-07-07 00:52:20', 2, 1, 5, '2025-07-06 17:52:20', '2025-07-06 17:52:20'),
(47, 'Kiểm tra tính toàn vẹn để?', 'Dữ liệu chính xác', 'Giảm dung lượng', 'Tạo file', 'Vẽ sơ đồ', 'A', 'Trung Bình', '2025-07-07 00:52:20', 2, 1, 5, '2025-07-06 17:52:20', '2025-07-06 17:52:20'),
(48, 'Bảo mật vật lý là?', 'Bảo vệ phần cứng', 'Bảo vệ phần mềm', 'Bảo vệ dữ liệu', 'Bảo vệ tài liệu', 'A', 'Khó', '2025-07-07 00:52:20', 2, 1, 5, '2025-07-06 17:52:20', '2025-07-06 17:52:20'),
(49, 'Bảo mật logic là?', 'Bảo vệ truy cập dữ liệu', 'Bảo vệ thiết bị', 'Bảo vệ file word', 'Bảo vệ hình ảnh', 'A', 'Khó', '2025-07-07 00:52:20', 2, 1, 5, '2025-07-06 17:52:20', '2025-07-06 17:52:20'),
(50, 'Sao lưu định kỳ để?', 'Luôn có bản dự phòng mới', 'Giảm tốc độ', 'Tăng dung lượng', 'Xóa dữ liệu', 'A', 'Dễ', '2025-07-07 00:52:20', 2, 1, 5, '2025-07-06 17:52:20', '2025-07-06 17:52:20'),
(51, 'Lập trình hướng đối tượng là gì?', 'Lập trình dựa trên đối tượng', 'Lập trình dựa trên hàm', 'Lập trình dựa trên cấu trúc', 'Lập trình không cấu trúc', 'A', 'Dễ', '2025-07-07 00:52:50', 3, 2, 6, '2025-07-06 17:52:50', '2025-07-06 17:52:50'),
(52, 'Đặc trưng của OOP?', 'Đóng gói, kế thừa, đa hình', 'Hàm, thủ tục', 'Biến toàn cục', 'Gán trực tiếp', 'A', 'Dễ', '2025-07-07 00:52:50', 3, 2, 6, '2025-07-06 17:52:50', '2025-07-06 17:52:50'),
(53, 'Đối tượng là?', 'Thực thể có trạng thái và hành vi', 'Biến', 'Hàm', 'Cấu trúc', 'A', 'Dễ', '2025-07-07 00:52:50', 3, 2, 6, '2025-07-06 17:52:50', '2025-07-06 17:52:50'),
(54, 'Lớp là?', 'Khuôn mẫu tạo đối tượng', 'Biến toàn cục', 'Hàm chính', 'Hàm con', 'A', 'Dễ', '2025-07-07 00:52:50', 3, 2, 6, '2025-07-06 17:52:50', '2025-07-06 17:52:50'),
(55, 'OOP giúp?', 'Tái sử dụng mã', 'Tăng lỗi', 'Khó bảo trì', 'Giảm tính mở rộng', 'A', 'Khó', '2025-07-07 00:52:50', 3, 2, 6, '2025-07-06 17:52:50', '2025-07-06 17:52:50'),
(56, 'Đóng gói nghĩa là?', 'Giấu dữ liệu', 'Lộ dữ liệu', 'Không cần bảo vệ', 'Xóa dữ liệu', 'A', 'Trung Bình', '2025-07-07 00:52:50', 3, 2, 6, '2025-07-06 17:52:50', '2025-07-06 17:52:50'),
(57, 'Kế thừa nghĩa là?', 'Lớp con thừa hưởng lớp cha', 'Không có liên kết', 'Không thể dùng lại', 'Tạo mới hoàn toàn', 'A', 'Trung Bình', '2025-07-07 00:52:50', 3, 2, 6, '2025-07-06 17:52:50', '2025-07-06 17:52:50'),
(58, 'Đa hình nghĩa là?', 'Một hàm nhiều cách thực hiện', 'Một hàm chỉ 1 cách', 'Không thể mở rộng', 'Giống nhau hoàn toàn', 'A', 'Trung Bình', '2025-07-07 00:52:50', 3, 2, 6, '2025-07-06 17:52:50', '2025-07-06 17:52:50'),
(59, 'Tính trừu tượng nghĩa là?', 'Ẩn chi tiết', 'Hiện tất cả', 'Không bảo vệ', 'Tăng lỗi', 'A', 'Trung Bình', '2025-07-07 00:52:50', 3, 2, 6, '2025-07-06 17:52:50', '2025-07-06 17:52:50'),
(60, 'OOP ra đời để?', 'Giải quyết phức tạp', 'Tăng lỗi', 'Giảm bảo trì', 'Khó đọc mã', 'A', 'Khó', '2025-07-07 00:52:50', 3, 2, 6, '2025-07-06 17:52:50', '2025-07-06 17:52:50'),
(61, 'Lớp mô tả?', 'Thuộc tính và phương thức', 'Chỉ thuộc tính', 'Chỉ phương thức', 'Không mô tả', 'A', 'Dễ', '2025-07-07 00:53:05', 3, 2, 7, '2025-07-06 17:53:05', '2025-07-06 17:53:05'),
(62, 'Đối tượng là?', 'Thể hiện của lớp', 'Một hàm', 'Một biến', 'Một thư viện', 'A', 'Dễ', '2025-07-07 00:53:05', 3, 2, 7, '2025-07-06 17:53:05', '2025-07-06 17:53:05'),
(63, 'Thuộc tính là?', 'Đặc điểm đối tượng', 'Hành vi đối tượng', 'Hàm toàn cục', 'Hàm main', 'A', 'Dễ', '2025-07-07 00:53:05', 3, 2, 7, '2025-07-06 17:53:05', '2025-07-06 17:53:05'),
(64, 'Phương thức là?', 'Hành vi đối tượng', 'Thuộc tính', 'Biến toàn cục', 'Biến cục bộ', 'A', 'Dễ', '2025-07-07 00:53:05', 3, 2, 7, '2025-07-06 17:53:05', '2025-07-06 17:53:05'),
(65, 'Constructor dùng để?', 'Khởi tạo đối tượng', 'Xóa đối tượng', 'Gọi main', 'Xóa class', 'A', 'Trung Bình', '2025-07-07 00:53:05', 3, 2, 7, '2025-07-06 17:53:05', '2025-07-06 17:53:05'),
(66, 'Destructor dùng để?', 'Giải phóng đối tượng', 'Tạo đối tượng', 'Gọi main', 'Tạo class', 'A', 'Trung Bình', '2025-07-07 00:53:05', 3, 2, 7, '2025-07-06 17:53:05', '2025-07-06 17:53:05'),
(67, 'Từ khóa new dùng để?', 'Cấp phát bộ nhớ', 'Giải phóng bộ nhớ', 'Xóa đối tượng', 'Xóa class', 'A', 'Trung Bình', '2025-07-07 00:53:05', 3, 2, 7, '2025-07-06 17:53:05', '2025-07-06 17:53:05'),
(68, 'Từ khóa delete dùng để?', 'Giải phóng bộ nhớ', 'Tạo đối tượng', 'Tạo class', 'Khởi tạo', 'A', 'Trung Bình', '2025-07-07 00:53:05', 3, 2, 7, '2025-07-06 17:53:05', '2025-07-06 17:53:05'),
(69, 'Đối tượng có thể?', 'Gọi phương thức', 'Không gọi gì', 'Chỉ lưu dữ liệu', 'Chỉ lưu tên', 'A', 'Khó', '2025-07-07 00:53:05', 3, 2, 7, '2025-07-06 17:53:05', '2025-07-06 17:53:05'),
(70, 'Một lớp có thể có?', 'Nhiều đối tượng', 'Chỉ 1 đối tượng', 'Không có đối tượng', '1 đối tượng duy nhất', 'A', 'Khó', '2025-07-07 00:53:05', 3, 2, 7, '2025-07-06 17:53:05', '2025-07-06 17:53:05'),
(71, 'Kế thừa là?', 'Lớp con thừa hưởng lớp cha', 'Không liên kết', 'Không thể dùng lại', 'Tạo mới hoàn toàn', 'A', 'Dễ', '2025-07-07 00:53:57', 3, 2, 8, '2025-07-06 17:53:57', '2025-07-06 17:53:57'),
(72, 'Từ khóa kế thừa trong C++?', 'public', 'extends', 'inherit', 'implements', 'A', 'Dễ', '2025-07-07 00:53:57', 3, 2, 8, '2025-07-06 17:53:57', '2025-07-06 17:53:57'),
(73, 'Kế thừa giúp?', 'Tái sử dụng mã', 'Tăng lỗi', 'Khó mở rộng', 'Không tái sử dụng', 'A', 'Dễ', '2025-07-07 00:53:57', 3, 2, 8, '2025-07-06 17:53:57', '2025-07-06 17:53:57'),
(74, 'Kế thừa đơn nghĩa là?', 'Lớp con từ 1 lớp cha', 'Lớp con từ nhiều lớp', 'Không kế thừa', 'Kế thừa toàn bộ', 'A', 'Dễ', '2025-07-07 00:53:57', 3, 2, 8, '2025-07-06 17:53:57', '2025-07-06 17:53:57'),
(75, 'Kế thừa đa nghĩa là?', 'Lớp con từ nhiều lớp cha', 'Không kế thừa', 'Kế thừa 1 lớp', 'Kế thừa không toàn bộ', 'A', 'Trung Bình', '2025-07-07 00:53:57', 3, 2, 8, '2025-07-06 17:53:57', '2025-07-06 17:53:57'),
(76, 'Kế thừa bảo vệ nghĩa là?', 'Chỉ lớp con truy cập', 'Ai cũng truy cập', 'Không ai truy cập', 'Truy cập toàn cục', 'A', 'Trung Bình', '2025-07-07 00:53:57', 3, 2, 8, '2025-07-06 17:53:57', '2025-07-06 17:53:57'),
(77, 'Base class nghĩa là?', 'Lớp cơ sở', 'Lớp kế thừa', 'Lớp chính', 'Lớp tĩnh', 'A', 'Trung Bình', '2025-07-07 00:53:57', 3, 2, 8, '2025-07-06 17:53:57', '2025-07-06 17:53:57'),
(78, 'Derived class nghĩa là?', 'Lớp dẫn xuất', 'Lớp chính', 'Lớp cơ sở', 'Lớp tĩnh', 'A', 'Khó', '2025-07-07 00:53:57', 3, 2, 8, '2025-07-06 17:53:57', '2025-07-06 17:53:57'),
(79, 'Access specifier nào cho kế thừa công khai?', 'public', 'private', 'protected', 'friend', 'A', 'Khó', '2025-07-07 00:53:57', 3, 2, 8, '2025-07-06 17:53:57', '2025-07-06 17:53:57'),
(80, 'Access specifier nào kế thừa bảo vệ?', 'protected', 'public', 'private', 'virtual', 'A', 'Trung Bình', '2025-07-07 00:53:57', 3, 2, 8, '2025-07-06 17:53:57', '2025-07-06 17:53:57'),
(81, 'Đa hình là?', '1 giao diện nhiều thực hiện', '1 giao diện 1 thực hiện', 'Không có giao diện', 'Chỉ 1 cách duy nhất', 'A', 'Dễ', '2025-07-07 00:54:20', 3, 2, 9, '2025-07-06 17:54:20', '2025-07-06 17:54:20'),
(82, 'Đa hình biên dịch là?', 'Overloading', 'Overriding', 'Interface', 'Abstract', 'A', 'Trung Bình', '2025-07-07 00:54:20', 3, 2, 9, '2025-07-06 17:54:20', '2025-07-06 17:54:20'),
(83, 'Đa hình chạy thời gian là?', 'Overriding', 'Overloading', 'Interface', 'Abstract', 'A', 'Trung Bình', '2025-07-07 00:54:20', 3, 2, 9, '2025-07-06 17:54:20', '2025-07-06 17:54:20'),
(84, 'Overloading là?', 'Nhiều hàm cùng tên khác tham số', '1 hàm nhiều tên', 'Không có hàm', '1 hàm 1 tham số', 'A', 'Trung Bình', '2025-07-07 00:54:20', 3, 2, 9, '2025-07-06 17:54:20', '2025-07-06 17:54:20'),
(85, 'Overriding là?', 'Lớp con định nghĩa lại hàm lớp cha', 'Hàm giống nhau', 'Không định nghĩa lại', 'Hàm riêng biệt', 'A', 'Trung Bình', '2025-07-07 00:54:20', 3, 2, 9, '2025-07-06 17:54:20', '2025-07-06 17:54:20'),
(86, 'Từ khóa virtual dùng để?', 'Đa hình động', 'Đa hình tĩnh', 'Không đa hình', 'Chống đa hình', 'A', 'Dễ', '2025-07-07 00:54:20', 3, 2, 9, '2025-07-06 17:54:20', '2025-07-06 17:54:20'),
(87, 'Pure virtual function là?', 'Hàm ảo thuần túy', 'Hàm thực', 'Hàm riêng', 'Hàm main', 'A', 'Dễ', '2025-07-07 00:54:20', 3, 2, 9, '2025-07-06 17:54:20', '2025-07-06 17:54:20'),
(88, 'Interface là?', 'Chỉ định các hàm cần định nghĩa', 'Định nghĩa sẵn', 'Không hàm', 'Chứa biến toàn cục', 'A', 'Khó', '2025-07-07 00:54:20', 3, 2, 9, '2025-07-06 17:54:20', '2025-07-06 17:54:20'),
(89, 'Abstract class là?', 'Chứa hàm thuần ảo', 'Không có hàm', 'Không có biến', 'Hàm static', 'A', 'Khó', '2025-07-07 00:54:20', 3, 2, 9, '2025-07-06 17:54:20', '2025-07-06 17:54:20'),
(90, 'Đa hình giúp?', 'Mã linh hoạt', 'Khó mở rộng', 'Tăng lỗi', 'Giảm tái sử dụng', 'A', 'Dễ', '2025-07-07 00:54:20', 3, 2, 9, '2025-07-06 17:54:20', '2025-07-06 17:54:20'),
(91, 'Ngoại lệ là?', 'Lỗi xảy ra khi chạy', 'Lỗi biên dịch', 'Lỗi cú pháp', 'Lỗi giao diện', 'A', 'Dễ', '2025-07-07 00:54:47', 3, 2, 10, '2025-07-06 17:54:47', '2025-07-06 17:54:47'),
(92, 'Từ khóa bắt ngoại lệ?', 'try', 'catch', 'throw', 'throws', 'A', 'Dễ', '2025-07-07 00:54:47', 3, 2, 10, '2025-07-06 17:54:47', '2025-07-06 17:54:47'),
(93, 'Từ khóa xử lý ngoại lệ?', 'catch', 'try', 'throw', 'throws', 'A', 'Dễ', '2025-07-07 00:54:47', 3, 2, 10, '2025-07-06 17:54:47', '2025-07-06 17:54:47'),
(94, 'Từ khóa ném ngoại lệ?', 'throw', 'try', 'catch', 'throws', 'A', 'Dễ', '2025-07-07 00:54:47', 3, 2, 10, '2025-07-06 17:54:47', '2025-07-06 17:54:47'),
(95, 'I/O là?', 'Input/Output', 'Inside/Outside', 'Internal/Output', 'Internet/Output', 'A', 'Trung Bình', '2025-07-07 00:54:47', 3, 2, 10, '2025-07-06 17:54:47', '2025-07-06 17:54:47'),
(96, 'C++ I/O dùng?', 'cin, cout', 'printf, scanf', 'System.out.println', 'print', 'A', 'Trung Bình', '2025-07-07 00:54:47', 3, 2, 10, '2025-07-06 17:54:47', '2025-07-06 17:54:47'),
(97, 'Đọc file dùng?', 'ifstream', 'ofstream', 'fstream', 'fileinput', 'A', 'Trung Bình', '2025-07-07 00:54:47', 3, 2, 10, '2025-07-06 17:54:47', '2025-07-06 17:54:47'),
(98, 'Ghi file dùng?', 'ofstream', 'ifstream', 'fileinput', 'cin', 'A', 'Trung Bình', '2025-07-07 00:54:47', 3, 2, 10, '2025-07-06 17:54:47', '2025-07-06 17:54:47'),
(99, 'fstream dùng cho?', 'Đọc ghi file', 'Chỉ đọc file', 'Chỉ ghi file', 'Chỉ xóa file', 'A', 'Khó', '2025-07-07 00:54:47', 3, 2, 10, '2025-07-06 17:54:47', '2025-07-06 17:54:47'),
(100, 'Xử lý ngoại lệ giúp?', 'Chương trình an toàn', 'Tăng lỗi', 'Giảm hiệu quả', 'Khó đọc', 'A', 'Khó', '2025-07-07 00:54:47', 3, 2, 10, '2025-07-06 17:54:47', '2025-07-06 17:54:47'),
(101, 'Python bị ảnh hưởng bởi?', 'C và C++', 'Java và Perl', 'Lisp và Haskell', 'Tất cả đều đúng', 'D', 'Trung Bình', '2025-07-07 01:03:04', 4, 3, 11, '2025-07-06 18:03:04', '2025-07-06 18:03:04'),
(102, 'Phần mở rộng tên file Python là?', '.py', '.pyi', '.pyc và .pyd', 'Tất cả đều đúng', 'D', 'Dễ', '2025-07-07 01:03:04', 4, 3, 11, '2025-07-06 18:03:04', '2025-07-06 18:03:04'),
(103, 'Python xuất hiện lần đầu tiên vào?', 'January 1982', 'February 1991', 'December 1987', 'July 2001', 'B', 'Dễ', '2025-07-07 01:03:04', 4, 3, 11, '2025-07-06 18:03:04', '2025-07-06 18:03:04'),
(104, 'Python được tạo ra bởi?', 'Guido van Rossum', 'James Gosling', 'Dennis Ritchie', 'Bjarne Stroustrup', 'A', 'Dễ', '2025-07-07 01:03:04', 4, 3, 11, '2025-07-06 18:03:04', '2025-07-06 18:03:04'),
(105, 'Python là?', 'ngôn ngữ lập trình đa năng, thông dịch, cấp cao', 'ngôn ngữ lập trình hướng đối tượng', 'ngôn ngữ lập trình thủ tục, hàm, cấu trúc', 'tất cả đều đúng', 'D', 'Dễ', '2025-07-07 01:03:04', 4, 3, 11, '2025-07-06 18:03:04', '2025-07-06 18:03:04'),
(106, 'Câu lệnh nào sau đây đúng để in chuỗi “Hello World!”?', 'print(\"Hello, World!\")', 'printf(\"Hello, World!\")', 'console(\"Hello, World!\")', 'System.out.print(\"Hello, World!\")', 'A', 'Trung Bình', '2025-07-07 01:03:04', 4, 3, 11, '2025-07-06 18:03:04', '2025-07-06 18:03:04'),
(107, 'Python được phát triển như sự kế thừa của?', 'Java', 'Lisp', 'ABC', 'C++', 'C', 'Khó', '2025-07-07 01:03:04', 4, 3, 11, '2025-07-06 18:03:04', '2025-07-06 18:03:04'),
(108, 'Điều nào được coi là chú thích trong Python?', '# Đây là một chú thích', '\"\"\" Đây là một chú thích \"\"\"', '\'Đây là một chú thích\'', 'Tất cả đều đúng', 'D', 'Trung Bình', '2025-07-07 01:03:04', 4, 3, 11, '2025-07-06 18:03:04', '2025-07-06 18:03:04'),
(109, 'Trình biên dịch mặc định cho Python là?', 'Jython', 'Cython', 'PyPy', 'ActivePython', 'C', 'Khó', '2025-07-07 01:03:04', 4, 3, 11, '2025-07-06 18:03:04', '2025-07-06 18:03:04'),
(110, 'Tên nào không thể là tên biến Python?', 'Int_1', 'true', 'var-2', 'name3', 'B', 'Trung Bình', '2025-07-07 01:03:36', 4, 3, 12, '2025-07-06 18:03:36', '2025-07-06 18:03:36'),
(111, 'Cái nào không phải là kiểu dữ liệu Python?', 'int', 'string', 'char', 'set', 'C', 'Dễ', '2025-07-07 01:03:36', 4, 3, 12, '2025-07-06 18:03:36', '2025-07-06 18:03:36'),
(112, 'Kết quả của num=4+0j; print(type(num))?', '<class \'int\'>', '<class \'float\'>', '<class \'real\'>', '<class \'complex\'>', 'D', 'Khó', '2025-07-07 01:03:36', 4, 3, 12, '2025-07-06 18:03:36', '2025-07-06 18:03:36'),
(113, 'Kết quả của print(5//2)?', '1', '2', '2.5', 'Báo lỗi', 'B', 'Dễ', '2025-07-07 01:03:36', 4, 3, 12, '2025-07-06 18:03:36', '2025-07-06 18:03:36'),
(114, 'Kết quả của a=\'Python\'+\".py\"; print(a)?', 'Python.py', '\'Python\'+\".py\"', 'Python+.py', 'Báo lỗi', 'A', 'Dễ', '2025-07-07 01:03:36', 4, 3, 12, '2025-07-06 18:03:36', '2025-07-06 18:03:36'),
(115, 'Kết quả của set1={1,5,6,4,3}; print(set1)?', '{1,5,6,4,3}', '{1, 3, 4, 5, 6}', '1,5,6,4,3', '1, 3, 4, 5, 6', 'B', 'Trung Bình', '2025-07-07 01:03:36', 4, 3, 12, '2025-07-06 18:03:36', '2025-07-06 18:03:36'),
(116, 'Toán tử tính lũy thừa?', 'x^y', 'x*y', 'x**y', 'x***y', 'C', 'Khó', '2025-07-07 01:03:36', 4, 3, 12, '2025-07-06 18:03:36', '2025-07-06 18:03:36'),
(117, 'Độ dài tối đa của mã identifier trong python?', '256', '64', '128', 'Tất cả đều sai', 'D', 'Trung Bình', '2025-07-07 01:03:36', 4, 3, 12, '2025-07-06 18:03:36', '2025-07-06 18:03:36'),
(118, 'Kết quả của var=\"a \"*2*3; print(var)?', 'a * 2 * 3', 'a * 6', 'a a a a a a', 'Báo lỗi', 'C', 'Dễ', '2025-07-07 01:03:36', 4, 3, 12, '2025-07-06 18:03:36', '2025-07-06 18:03:36'),
(119, 'Phát biểu sai về tên biến?', 'Tên biến có thể dài tùy ý', 'Tên biến có thể chứa cả chữ cái và số', 'Tên biến có thể bắt đầu bằng dấu gạch dưới', 'Tên biến có thể bắt đầu bằng số', 'D', 'Trung Bình', '2025-07-07 01:03:36', 4, 3, 12, '2025-07-06 18:03:36', '2025-07-06 18:03:36'),
(120, 'Kết quả c=0; for i in \"abc xyz\": c+=1; print(c)?', '0', '6', '7', '8', 'C', 'Trung Bình', '2025-07-07 01:03:51', 4, 3, 13, '2025-07-06 18:03:51', '2025-07-06 18:03:51'),
(121, 'Đoạn code while(i<10)... chạy bao lần?', '3', '4', '5', '10', 'C', 'Trung Bình', '2025-07-07 01:03:51', 4, 3, 13, '2025-07-06 18:03:51', '2025-07-06 18:03:51'),
(122, 'Kết quả sign(0)?', 'Positive!', 'Negative!', 'Zero!', '0', 'C', 'Trung Bình', '2025-07-07 01:03:51', 4, 3, 13, '2025-07-06 18:03:51', '2025-07-06 18:03:51'),
(123, 'Kết quả number(2)?', '2', 'two', 'three', 'No Output!', 'B', 'Dễ', '2025-07-07 01:03:51', 4, 3, 13, '2025-07-06 18:03:51', '2025-07-06 18:03:51'),
(124, 'Không phải câu lệnh điều khiển?', 'break', 'continue', 'end', 'Tất cả đều sai', 'C', 'Dễ', '2025-07-07 01:03:51', 4, 3, 13, '2025-07-06 18:03:51', '2025-07-06 18:03:51'),
(125, 'Chức năng của continue?', 'Code dưới bỏ qua cho lần lặp đó', 'Code dưới thực thi', 'Dừng vòng lặp', 'Tất cả sai', 'A', 'Dễ', '2025-07-07 01:03:51', 4, 3, 13, '2025-07-06 18:03:51', '2025-07-06 18:03:51'),
(126, 'Từ khóa break?', 'Đưa quyền kiểm soát ra khỏi vòng lặp', 'Không dùng được', 'Phải đi với else', 'Chỉ dùng trong if', 'A', 'Dễ', '2025-07-07 01:03:51', 4, 3, 13, '2025-07-06 18:03:51', '2025-07-06 18:03:51'),
(127, 'Kết quả for num in range(10,14)...?', '11 13', '10 11 12 13', '10 12 14', '10 12', 'A', 'Khó', '2025-07-07 01:03:51', 4, 3, 13, '2025-07-06 18:03:51', '2025-07-06 18:03:51'),
(128, 'Kết quả for num in range(-2,-5,-1)...?', '-2, -3, -4,', '-2, -1, 0,', '-2, -1, -3, -4,', '-2, -1, 0, 1, 2, 3,', 'A', 'Trung Bình', '2025-07-07 01:03:51', 4, 3, 13, '2025-07-06 18:03:51', '2025-07-06 18:03:51'),
(129, 'Kết quả var=10...?', '10', '20', '21', '30', 'C', 'Khó', '2025-07-07 01:03:51', 4, 3, 13, '2025-07-06 18:03:51', '2025-07-06 18:03:51'),
(130, 'Phát biểu đúng về hàm do người dùng định nghĩa?', 'Hàm nên có return cuối', 'Tên hàm xác định bởi người dùng', 'Thân hàm thụt vào, bao {}', 'Thân hàm không thụt vào, bao {}', 'B', 'Dễ', '2025-07-07 01:04:20', 4, 3, 14, '2025-07-06 18:04:20', '2025-07-06 18:04:20'),
(131, 'Lệnh truy cập docstring?', 'functionName.doc()', 'docstring(functionName)', 'functionName.__doc__', 'functioName.__doc__()', 'C', 'Trung Bình', '2025-07-07 01:04:20', 4, 3, 14, '2025-07-06 18:04:20', '2025-07-06 18:04:20'),
(132, 'Cú pháp định nghĩa hàm đối số độ dài thay đổi?', 'def fun(**vals):...', 'def fun(vals[]):...', 'def fun(*vals):...', 'Tất cả đều đúng', 'C', 'Dễ', '2025-07-07 01:04:20', 4, 3, 14, '2025-07-06 18:04:20', '2025-07-06 18:04:20'),
(133, 'Kết quả def func(): print(\"Hi!\")?', 'Hi!', '\'Hi!\'', 'Không xuất gì', 'Báo lỗi', 'A', 'Dễ', '2025-07-07 01:04:20', 4, 3, 14, '2025-07-06 18:04:20', '2025-07-06 18:04:20'),
(134, 'Kết quả fun(1,2) với def fun(x,y=0,z)?', '-1', '3', 'Giá trị rác', 'Báo lỗi', 'D', 'Trung Bình', '2025-07-07 01:04:20', 4, 3, 14, '2025-07-06 18:04:20', '2025-07-06 18:04:20'),
(135, 'Kết quả print(name)? với name=\"Python\"...', 'Python', 'Hello world!', 'PythonHello world!', 'Báo lỗi', 'A', 'Dễ', '2025-07-07 01:04:20', 4, 3, 14, '2025-07-06 18:04:20', '2025-07-06 18:04:20'),
(136, 'Kết quả n=4...f1()?', '4', '16', '256', 'Báo lỗi', 'D', 'Khó', '2025-07-07 01:04:20', 4, 3, 14, '2025-07-06 18:04:20', '2025-07-06 18:04:20'),
(137, 'Hàm range() trả về?', 'list', 'range', 'set', 'dictionary', 'B', 'Trung Bình', '2025-07-07 01:04:20', 4, 3, 14, '2025-07-06 18:04:20', '2025-07-06 18:04:20'),
(138, 'Giá trị mặc định bước nhảy range()?', '0', '1', '-1', 'Bắt buộc truyền', 'B', 'Trung Bình', '2025-07-07 01:04:20', 4, 3, 14, '2025-07-06 18:04:20', '2025-07-06 18:04:20'),
(139, 'Kết quả cal(3) với def cal(num1=1,num2=2)?', '2', '6', 'Giá trị rác', 'Báo lỗi', 'B', 'Khó', '2025-07-07 01:04:20', 4, 3, 14, '2025-07-06 18:04:20', '2025-07-06 18:04:20'),
(140, 'Kết quả print(type({}))?', '<class \'set\'>', '<class \'list\'>', '<class \'tuple\'>', '<class \'dict\'>', 'D', 'Dễ', '2025-07-07 01:06:02', 4, 3, 15, '2025-07-06 18:06:02', '2025-07-06 18:06:02'),
(141, 'Kết quả str1=\"Information\"; print(str1[2:8])?', 'format', 'norma', 'formatio', 'nformati', 'B', 'Trung Bình', '2025-07-07 01:06:02', 4, 3, 15, '2025-07-06 18:06:02', '2025-07-06 18:06:02'),
(142, 'Cái nào không phải thuộc tính list?', 'Có thứ tự', 'Có thể thay đổi', 'Chỉ chứa phần tử cùng loại', 'Có thể chứa giá trị trùng lặp', 'C', 'Dễ', '2025-07-07 01:06:02', 4, 3, 15, '2025-07-06 18:06:02', '2025-07-06 18:06:02'),
(143, 'Cái nào không thể thêm phần tử vào list?', 'add()', 'insert()', 'append()', 'extend()', 'A', 'Dễ', '2025-07-07 01:06:02', 4, 3, 15, '2025-07-06 18:06:02', '2025-07-06 18:06:02'),
(144, 'Điều nào không phải tính chất tuple?', 'có thứ tự', 'tính bất biến', 'không cho phép giá trị trùng', 'Tất cả đúng', 'C', 'Dễ', '2025-07-07 01:06:02', 4, 3, 15, '2025-07-06 18:06:02', '2025-07-06 18:06:02'),
(145, 'Cái nào dùng làm khóa dictionary?', 'List', 'Tuple', 'Set', 'Dictionary', 'B', 'Trung Bình', '2025-07-07 01:06:02', 4, 3, 15, '2025-07-06 18:06:02', '2025-07-06 18:06:02'),
(146, 'Hàm không áp dụng cho tuple?', 'len()', 'sorted()', 'index()', 'sort()', 'D', 'Trung Bình', '2025-07-07 01:06:02', 4, 3, 15, '2025-07-06 18:06:02', '2025-07-06 18:06:02'),
(147, 'Kết quả dict={1:\'r\',2:6,1:5,3:\'y\'}; print(dict)?', '{1: 5, 2: 6, 3: \'y\'}', '{1:\'r\',2:6,1:5,3:\'y\'}', '{1:\'r\',2:6,3:\'y\'}', '{2:6,1:\'r\',3:\'y\'}', 'A', 'Khó', '2025-07-07 01:06:02', 4, 3, 15, '2025-07-06 18:06:02', '2025-07-06 18:06:02'),
(148, 'Kết quả dict={0:\'r\',4:\'y\',7.6:5}; dict[2]=5; print(dict)?', '{0: \'r\', 2: 5, 4: \'y\', 7.6: 5}', '{0: \'r\', 4: \'y\', 2: 5}', '{2: 5, 0: \'r\', 4: \'y\', 7.6: 5}', '{0: \'r\', 4: \'y\', 7.6: 5, 2: 5}', 'A', 'Khó', '2025-07-07 01:06:02', 4, 3, 15, '2025-07-06 18:06:02', '2025-07-06 18:06:02'),
(149, '____, ____, ____ lần lượt cho list, dict, tuple?', '[ ], { }, ( )', '{ }, ( ), [ ]', '( ), [ ], { }', '( ), { }, [ ]', 'A', 'Trung Bình', '2025-07-07 01:06:02', 4, 3, 15, '2025-07-06 18:06:02', '2025-07-06 18:06:02'),
(150, 'Cú pháp tạo dự án Django?', 'py manage.py start-django my_project', 'django-admin startproject my_project', 'django startproject my_project', 'py start-django my_project', 'B', 'Dễ', '2025-07-07 01:06:15', 4, 3, 16, '2025-07-06 18:06:15', '2025-07-06 18:06:15'),
(151, 'File không phải của dự án Django?', 'settings.py', 'manage.py', 'templates.py', '__init__.py', 'C', 'Dễ', '2025-07-07 01:06:15', 4, 3, 16, '2025-07-06 18:06:15', '2025-07-06 18:06:15'),
(152, 'Mã RGB (255,0,0) OpenCV hiểu là?', 'Blue', 'Green', 'Yellow', 'Cyan', 'A', 'Trung Bình', '2025-07-07 01:06:15', 4, 3, 16, '2025-07-06 18:06:15', '2025-07-06 18:06:15'),
(153, 'Câu lệnh import cv2?', 'Import SciPy', 'Import NumPy', 'Import OpenCV Python', 'Import hiển thị ảnh', 'C', 'Khó', '2025-07-07 01:06:15', 4, 3, 16, '2025-07-06 18:06:15', '2025-07-06 18:06:15'),
(154, 'OpenCV lưu pixel RGB thứ tự?', 'GBR', 'RGB', 'BRG', 'BGR', 'D', 'Trung Bình', '2025-07-07 01:06:15', 4, 3, 16, '2025-07-06 18:06:15', '2025-07-06 18:06:15');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `chi_tiet_bai_lam`
--

CREATE TABLE `chi_tiet_bai_lam` (
  `maBL` bigint(20) UNSIGNED NOT NULL,
  `maCH` bigint(20) UNSIGNED NOT NULL,
  `thuTuCauHoi` int(11) NOT NULL,
  `hienThiA` enum('A','B','C','D') NOT NULL,
  `hienThiB` enum('A','B','C','D') NOT NULL,
  `hienThiC` enum('A','B','C','D') NOT NULL,
  `hienThiD` enum('A','B','C','D') NOT NULL,
  `dapAnChon` enum('A','B','C','D') DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `chi_tiet_bai_lam`
--

INSERT INTO `chi_tiet_bai_lam` (`maBL`, `maCH`, `thuTuCauHoi`, `hienThiA`, `hienThiB`, `hienThiC`, `hienThiD`, `dapAnChon`, `created_at`, `updated_at`) VALUES
(1, 25, 1, 'B', 'D', 'C', 'A', 'A', '2025-07-06 19:22:40', '2025-07-06 19:25:48'),
(1, 29, 2, 'B', 'A', 'D', 'C', 'A', '2025-07-06 19:22:40', '2025-07-06 19:25:48'),
(1, 37, 3, 'A', 'C', 'D', 'B', 'A', '2025-07-06 19:22:40', '2025-07-06 19:25:48'),
(1, 27, 4, 'B', 'A', 'D', 'C', 'D', '2025-07-06 19:22:40', '2025-07-06 19:25:48'),
(1, 39, 5, 'C', 'A', 'B', 'D', 'C', '2025-07-06 19:22:40', '2025-07-06 19:25:48'),
(1, 23, 6, 'B', 'C', 'A', 'D', 'A', '2025-07-06 19:22:40', '2025-07-06 19:25:48'),
(1, 32, 7, 'D', 'A', 'B', 'C', 'A', '2025-07-06 19:22:40', '2025-07-06 19:25:48'),
(1, 30, 8, 'D', 'A', 'B', 'C', 'A', '2025-07-06 19:22:40', '2025-07-06 19:25:48'),
(1, 26, 9, 'A', 'C', 'B', 'D', 'A', '2025-07-06 19:22:40', '2025-07-06 19:25:48'),
(1, 35, 10, 'C', 'D', 'A', 'B', 'B', '2025-07-06 19:22:40', '2025-07-06 19:25:48'),
(1, 31, 11, 'A', 'B', 'D', 'C', 'C', '2025-07-06 19:22:40', '2025-07-06 19:25:48'),
(1, 22, 12, 'B', 'A', 'D', 'C', 'B', '2025-07-06 19:22:40', '2025-07-06 19:25:48'),
(1, 38, 13, 'B', 'C', 'D', 'A', 'A', '2025-07-06 19:22:40', '2025-07-06 19:25:48'),
(1, 24, 14, 'C', 'B', 'D', 'A', 'B', '2025-07-06 19:22:40', '2025-07-06 19:25:48'),
(1, 21, 15, 'B', 'C', 'A', 'D', 'A', '2025-07-06 19:22:40', '2025-07-06 19:25:48'),
(1, 40, 16, 'A', 'D', 'B', 'C', 'B', '2025-07-06 19:22:40', '2025-07-06 19:25:48'),
(1, 36, 17, 'B', 'A', 'D', 'C', 'A', '2025-07-06 19:22:40', '2025-07-06 19:25:48'),
(1, 34, 18, 'B', 'C', 'D', 'A', 'D', '2025-07-06 19:22:40', '2025-07-06 19:25:48'),
(1, 33, 19, 'B', 'D', 'A', 'C', 'A', '2025-07-06 19:22:40', '2025-07-06 19:25:48'),
(1, 28, 20, 'C', 'A', 'D', 'B', 'A', '2025-07-06 19:22:40', '2025-07-06 19:25:48'),
(2, 40, 1, 'A', 'B', 'C', 'D', 'B', '2025-07-16 18:56:31', '2025-07-16 18:59:04'),
(2, 24, 2, 'A', 'C', 'B', 'D', 'B', '2025-07-16 18:56:31', '2025-07-16 18:59:04'),
(2, 38, 3, 'C', 'D', 'B', 'A', 'A', '2025-07-16 18:56:31', '2025-07-16 18:59:04'),
(2, 21, 4, 'A', 'B', 'C', 'D', 'A', '2025-07-16 18:56:31', '2025-07-16 18:59:04'),
(2, 26, 5, 'C', 'A', 'B', 'D', 'D', '2025-07-16 18:56:31', '2025-07-16 18:59:04'),
(2, 31, 6, 'D', 'B', 'A', 'C', 'C', '2025-07-16 18:56:31', '2025-07-16 18:59:04'),
(2, 39, 7, 'A', 'B', 'C', 'D', 'A', '2025-07-16 18:56:31', '2025-07-16 18:59:04'),
(2, 27, 8, 'D', 'A', 'C', 'B', 'A', '2025-07-16 18:56:31', '2025-07-16 18:59:04'),
(2, 29, 9, 'C', 'B', 'D', 'A', 'A', '2025-07-16 18:56:31', '2025-07-16 18:59:04'),
(2, 23, 10, 'D', 'B', 'C', 'A', 'A', '2025-07-16 18:56:31', '2025-07-16 18:59:04'),
(2, 28, 11, 'B', 'D', 'A', 'C', 'A', '2025-07-16 18:56:31', '2025-07-16 18:59:04'),
(2, 34, 12, 'A', 'B', 'C', 'D', 'D', '2025-07-16 18:56:31', '2025-07-16 18:59:04'),
(2, 25, 13, 'B', 'C', 'D', 'A', 'A', '2025-07-16 18:56:31', '2025-07-16 18:59:04'),
(2, 30, 14, 'A', 'B', 'C', 'D', 'A', '2025-07-16 18:56:31', '2025-07-16 18:59:04'),
(2, 37, 15, 'A', 'B', 'C', 'D', 'A', '2025-07-16 18:56:31', '2025-07-16 18:59:04'),
(2, 22, 16, 'D', 'C', 'B', 'A', 'B', '2025-07-16 18:56:31', '2025-07-16 18:59:04'),
(2, 35, 17, 'A', 'B', 'D', 'C', 'A', '2025-07-16 18:56:31', '2025-07-16 18:59:04'),
(2, 33, 18, 'A', 'C', 'B', 'D', 'A', '2025-07-16 18:56:31', '2025-07-16 18:59:04'),
(2, 32, 19, 'A', 'B', 'C', 'D', 'A', '2025-07-16 18:56:31', '2025-07-16 18:59:04'),
(2, 36, 20, 'B', 'D', 'A', 'C', 'A', '2025-07-16 18:56:31', '2025-07-16 18:59:04');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `chi_tiet_de_thi`
--

CREATE TABLE `chi_tiet_de_thi` (
  `maDT` bigint(20) UNSIGNED NOT NULL,
  `maCH` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `chi_tiet_de_thi`
--

INSERT INTO `chi_tiet_de_thi` (`maDT`, `maCH`, `created_at`, `updated_at`) VALUES
(1, 1, '2025-07-06 18:40:06', '2025-07-06 18:40:06'),
(1, 2, '2025-07-06 18:40:06', '2025-07-06 18:40:06'),
(1, 3, '2025-07-06 18:40:06', '2025-07-06 18:40:06'),
(1, 4, '2025-07-06 18:40:06', '2025-07-06 18:40:06'),
(1, 5, '2025-07-06 18:40:06', '2025-07-06 18:40:06'),
(1, 6, '2025-07-06 18:40:06', '2025-07-06 18:40:06'),
(1, 7, '2025-07-06 18:40:06', '2025-07-06 18:40:06'),
(1, 8, '2025-07-06 18:40:06', '2025-07-06 18:40:06'),
(1, 9, '2025-07-06 18:40:06', '2025-07-06 18:40:06'),
(1, 10, '2025-07-06 18:40:06', '2025-07-06 18:40:06'),
(1, 11, '2025-07-06 18:40:06', '2025-07-06 18:40:06'),
(1, 12, '2025-07-06 18:40:06', '2025-07-06 18:40:06'),
(1, 13, '2025-07-06 18:40:06', '2025-07-06 18:40:06'),
(1, 14, '2025-07-06 18:40:06', '2025-07-06 18:40:06'),
(1, 15, '2025-07-06 18:40:06', '2025-07-06 18:40:06'),
(1, 16, '2025-07-06 18:40:06', '2025-07-06 18:40:06'),
(1, 17, '2025-07-06 18:40:06', '2025-07-06 18:40:06'),
(1, 18, '2025-07-06 18:40:06', '2025-07-06 18:40:06'),
(1, 19, '2025-07-06 18:40:06', '2025-07-06 18:40:06'),
(1, 20, '2025-07-06 18:40:06', '2025-07-06 18:40:06'),
(2, 21, '2025-07-06 18:40:41', '2025-07-06 18:40:41'),
(2, 22, '2025-07-06 18:40:41', '2025-07-06 18:40:41'),
(2, 23, '2025-07-06 18:40:41', '2025-07-06 18:40:41'),
(2, 24, '2025-07-06 18:40:41', '2025-07-06 18:40:41'),
(2, 25, '2025-07-06 18:40:41', '2025-07-06 18:40:41'),
(2, 26, '2025-07-06 18:40:41', '2025-07-06 18:40:41'),
(2, 27, '2025-07-06 18:40:41', '2025-07-06 18:40:41'),
(2, 28, '2025-07-06 18:40:41', '2025-07-06 18:40:41'),
(2, 29, '2025-07-06 18:40:41', '2025-07-06 18:40:41'),
(2, 30, '2025-07-06 18:40:41', '2025-07-06 18:40:41'),
(2, 31, '2025-07-06 18:40:41', '2025-07-06 18:40:41'),
(2, 32, '2025-07-06 18:40:41', '2025-07-06 18:40:41'),
(2, 33, '2025-07-06 18:40:41', '2025-07-06 18:40:41'),
(2, 34, '2025-07-06 18:40:41', '2025-07-06 18:40:41'),
(2, 35, '2025-07-06 18:40:41', '2025-07-06 18:40:41'),
(2, 36, '2025-07-06 18:40:41', '2025-07-06 18:40:41'),
(2, 37, '2025-07-06 18:40:41', '2025-07-06 18:40:41'),
(2, 38, '2025-07-06 18:40:41', '2025-07-06 18:40:41'),
(2, 39, '2025-07-06 18:40:41', '2025-07-06 18:40:41'),
(2, 40, '2025-07-06 18:40:41', '2025-07-06 18:40:41'),
(3, 51, '2025-07-06 18:41:00', '2025-07-06 18:41:00'),
(3, 52, '2025-07-06 18:41:00', '2025-07-06 18:41:00'),
(3, 53, '2025-07-06 18:41:00', '2025-07-06 18:41:00'),
(3, 54, '2025-07-06 18:41:00', '2025-07-06 18:41:00'),
(3, 55, '2025-07-06 18:41:00', '2025-07-06 18:41:00'),
(3, 56, '2025-07-06 18:41:00', '2025-07-06 18:41:00'),
(3, 57, '2025-07-06 18:41:00', '2025-07-06 18:41:00'),
(3, 58, '2025-07-06 18:41:00', '2025-07-06 18:41:00'),
(3, 59, '2025-07-06 18:41:00', '2025-07-06 18:41:00'),
(3, 60, '2025-07-06 18:41:00', '2025-07-06 18:41:00'),
(3, 61, '2025-07-06 18:41:00', '2025-07-06 18:41:00'),
(3, 62, '2025-07-06 18:41:00', '2025-07-06 18:41:00'),
(3, 63, '2025-07-06 18:41:00', '2025-07-06 18:41:00'),
(3, 64, '2025-07-06 18:41:00', '2025-07-06 18:41:00'),
(3, 65, '2025-07-06 18:41:00', '2025-07-06 18:41:00'),
(3, 66, '2025-07-06 18:41:00', '2025-07-06 18:41:00'),
(3, 67, '2025-07-06 18:41:00', '2025-07-06 18:41:00'),
(3, 68, '2025-07-06 18:41:00', '2025-07-06 18:41:00'),
(3, 69, '2025-07-06 18:41:00', '2025-07-06 18:41:00'),
(3, 70, '2025-07-06 18:41:00', '2025-07-06 18:41:00'),
(4, 71, '2025-07-06 18:41:16', '2025-07-06 18:41:16'),
(4, 72, '2025-07-06 18:41:16', '2025-07-06 18:41:16'),
(4, 73, '2025-07-06 18:41:16', '2025-07-06 18:41:16'),
(4, 74, '2025-07-06 18:41:16', '2025-07-06 18:41:16'),
(4, 75, '2025-07-06 18:41:16', '2025-07-06 18:41:16'),
(4, 76, '2025-07-06 18:41:16', '2025-07-06 18:41:16'),
(4, 77, '2025-07-06 18:41:16', '2025-07-06 18:41:16'),
(4, 78, '2025-07-06 18:41:16', '2025-07-06 18:41:16'),
(4, 79, '2025-07-06 18:41:16', '2025-07-06 18:41:16'),
(4, 80, '2025-07-06 18:41:16', '2025-07-06 18:41:16'),
(4, 81, '2025-07-06 18:41:16', '2025-07-06 18:41:16'),
(4, 82, '2025-07-06 18:41:16', '2025-07-06 18:41:16'),
(4, 83, '2025-07-06 18:41:16', '2025-07-06 18:41:16'),
(4, 84, '2025-07-06 18:41:16', '2025-07-06 18:41:16'),
(4, 85, '2025-07-06 18:41:16', '2025-07-06 18:41:16'),
(4, 86, '2025-07-06 18:41:16', '2025-07-06 18:41:16'),
(4, 87, '2025-07-06 18:41:16', '2025-07-06 18:41:16'),
(4, 88, '2025-07-06 18:41:16', '2025-07-06 18:41:16'),
(4, 89, '2025-07-06 18:41:16', '2025-07-06 18:41:16'),
(4, 90, '2025-07-06 18:41:16', '2025-07-06 18:41:16'),
(5, 101, '2025-07-06 18:41:34', '2025-07-06 18:41:34'),
(5, 102, '2025-07-06 18:41:34', '2025-07-06 18:41:34'),
(5, 103, '2025-07-06 18:41:34', '2025-07-06 18:41:34'),
(5, 104, '2025-07-06 18:41:34', '2025-07-06 18:41:34'),
(5, 105, '2025-07-06 18:41:34', '2025-07-06 18:41:34'),
(5, 106, '2025-07-06 18:41:34', '2025-07-06 18:41:34'),
(5, 107, '2025-07-06 18:41:34', '2025-07-06 18:41:34'),
(5, 108, '2025-07-06 18:41:34', '2025-07-06 18:41:34'),
(5, 109, '2025-07-06 18:41:34', '2025-07-06 18:41:34'),
(5, 110, '2025-07-06 18:41:34', '2025-07-06 18:41:34'),
(5, 111, '2025-07-06 18:41:34', '2025-07-06 18:41:34'),
(5, 112, '2025-07-06 18:41:34', '2025-07-06 18:41:34'),
(5, 113, '2025-07-06 18:41:34', '2025-07-06 18:41:34'),
(5, 114, '2025-07-06 18:41:34', '2025-07-06 18:41:34'),
(5, 115, '2025-07-06 18:41:34', '2025-07-06 18:41:34'),
(5, 116, '2025-07-06 18:41:34', '2025-07-06 18:41:34'),
(5, 117, '2025-07-06 18:41:34', '2025-07-06 18:41:34'),
(5, 118, '2025-07-06 18:41:34', '2025-07-06 18:41:34'),
(5, 119, '2025-07-06 18:41:34', '2025-07-06 18:41:34'),
(5, 120, '2025-07-06 18:41:34', '2025-07-06 18:41:34'),
(6, 121, '2025-07-06 18:41:59', '2025-07-06 18:41:59'),
(6, 122, '2025-07-06 18:41:59', '2025-07-06 18:41:59'),
(6, 123, '2025-07-06 18:41:59', '2025-07-06 18:41:59'),
(6, 124, '2025-07-06 18:41:59', '2025-07-06 18:41:59'),
(6, 125, '2025-07-06 18:41:59', '2025-07-06 18:41:59'),
(6, 126, '2025-07-06 18:41:59', '2025-07-06 18:41:59'),
(6, 127, '2025-07-06 18:41:59', '2025-07-06 18:41:59'),
(6, 128, '2025-07-06 18:41:59', '2025-07-06 18:41:59'),
(6, 129, '2025-07-06 18:41:59', '2025-07-06 18:41:59'),
(6, 130, '2025-07-06 18:41:59', '2025-07-06 18:41:59'),
(6, 131, '2025-07-06 18:41:59', '2025-07-06 18:41:59'),
(6, 132, '2025-07-06 18:41:59', '2025-07-06 18:41:59'),
(6, 133, '2025-07-06 18:41:59', '2025-07-06 18:41:59'),
(6, 134, '2025-07-06 18:41:59', '2025-07-06 18:41:59'),
(6, 135, '2025-07-06 18:41:59', '2025-07-06 18:41:59'),
(6, 136, '2025-07-06 18:41:59', '2025-07-06 18:41:59'),
(6, 137, '2025-07-06 18:41:59', '2025-07-06 18:41:59'),
(6, 138, '2025-07-06 18:41:59', '2025-07-06 18:41:59'),
(6, 139, '2025-07-06 18:41:59', '2025-07-06 18:41:59'),
(6, 140, '2025-07-06 18:41:59', '2025-07-06 18:41:59');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `chuong`
--

CREATE TABLE `chuong` (
  `maChuong` bigint(20) UNSIGNED NOT NULL,
  `tenChuong` varchar(255) NOT NULL,
  `maMH` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `chuong`
--

INSERT INTO `chuong` (`maChuong`, `tenChuong`, `maMH`, `created_at`, `updated_at`) VALUES
(1, 'Chương 1: Tổng quan về cơ sở dữ liệu', 1, '2025-07-06 17:43:38', '2025-07-06 17:43:38'),
(2, 'Chương 2: Mô hình dữ liệu', 1, '2025-07-06 17:43:38', '2025-07-06 17:43:38'),
(3, 'Chương 3: Ngôn ngữ định nghĩa và thao tác dữ liệu', 1, '2025-07-06 17:43:38', '2025-07-06 17:43:38'),
(4, 'Chương 4: Thiết kế cơ sở dữ liệu', 1, '2025-07-06 17:43:38', '2025-07-06 17:43:38'),
(5, 'Chương 5: Quản trị cơ sở dữ liệu', 1, '2025-07-06 17:43:38', '2025-07-06 17:43:38'),
(6, 'Chương 1: Giới thiệu về lập trình hướng đối tượng', 2, '2025-07-06 17:43:53', '2025-07-06 17:43:53'),
(7, 'Chương 2: Lớp và đối tượng', 2, '2025-07-06 17:43:53', '2025-07-06 17:43:53'),
(8, 'Chương 3: Tính kế thừa', 2, '2025-07-06 17:43:53', '2025-07-06 17:43:53'),
(9, 'Chương 4: Tính đa hình', 2, '2025-07-06 17:43:53', '2025-07-06 17:43:53'),
(10, 'Chương 5: Xử lý ngoại lệ và luồng vào/ra', 2, '2025-07-06 17:43:53', '2025-07-06 17:43:53'),
(11, 'Chương 1: Giới thiệu về Python', 3, '2025-07-06 18:00:33', '2025-07-06 18:00:33'),
(12, 'Chương 2: Variables và Data Types', 3, '2025-07-06 18:00:33', '2025-07-06 18:00:33'),
(13, 'Chương 3: Cấu trúc điều khiển', 3, '2025-07-06 18:00:33', '2025-07-06 18:00:33'),
(14, 'Chương 4: Hàm', 3, '2025-07-06 18:00:33', '2025-07-06 18:00:33'),
(15, 'Chương 5: Cấu trúc dữ liệu', 3, '2025-07-06 18:00:33', '2025-07-06 18:00:33'),
(16, 'Chương 6: Các hướng ứng dụng', 3, '2025-07-06 18:00:33', '2025-07-06 18:00:33');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `de_thi`
--

CREATE TABLE `de_thi` (
  `maDT` bigint(20) UNSIGNED NOT NULL,
  `maTK` bigint(20) UNSIGNED NOT NULL,
  `tenDT` varchar(100) NOT NULL,
  `maMH` bigint(20) UNSIGNED NOT NULL,
  `maKT` bigint(20) UNSIGNED DEFAULT NULL,
  `thoiLuongPhut` int(11) NOT NULL,
  `moTa` text DEFAULT NULL,
  `ngayTao` datetime DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `de_thi`
--

INSERT INTO `de_thi` (`maDT`, `maTK`, `tenDT`, `maMH`, `maKT`, `thoiLuongPhut`, `moTa`, `ngayTao`, `created_at`, `updated_at`) VALUES
(1, 2, 'Đề giữa kỳ Cơ sở dữ liệu', 1, 1, 60, 'Đề thi giữa kỳ môn Cơ sở dữ liệu', '2025-07-07 01:31:48', '2025-07-06 18:31:48', '2025-07-06 18:31:48'),
(2, 2, 'Đề cuối kỳ Cơ sở dữ liệu', 1, 2, 60, 'Đề thi cuối kỳ môn Cơ sở dữ liệu', '2025-07-07 01:31:48', '2025-07-06 18:31:48', '2025-07-06 18:31:48'),
(3, 3, 'Đề giữa kỳ Lập trình hướng đối tượng', 2, 3, 60, 'Đề thi giữa kỳ môn Lập trình hướng đối tượng', '2025-07-07 01:32:12', '2025-07-06 18:32:12', '2025-07-06 18:32:12'),
(4, 3, 'Đề cuối kỳ Lập trình hướng đối tượng', 2, 4, 60, 'Đề thi cuối kỳ môn Lập trình hướng đối tượng', '2025-07-07 01:32:12', '2025-07-06 18:32:12', '2025-07-06 18:32:12'),
(5, 4, 'Đề giữa kỳ Lập trình Python', 3, 5, 60, 'Đề thi giữa kỳ môn Lập trình Python', '2025-07-07 01:32:39', '2025-07-06 18:32:39', '2025-07-06 18:32:39'),
(6, 4, 'Đề cuối kỳ Lập trình Python', 3, 6, 60, 'Đề thi cuối kỳ môn Lập trình Python', '2025-07-07 01:32:39', '2025-07-06 18:32:39', '2025-07-06 18:32:39');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(255) NOT NULL,
  `connection` text NOT NULL,
  `queue` text NOT NULL,
  `payload` longtext NOT NULL,
  `exception` longtext NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `jobs`
--

CREATE TABLE `jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `queue` varchar(255) NOT NULL,
  `payload` longtext NOT NULL,
  `attempts` tinyint(3) UNSIGNED NOT NULL,
  `reserved_at` int(10) UNSIGNED DEFAULT NULL,
  `available_at` int(10) UNSIGNED NOT NULL,
  `created_at` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `job_batches`
--

CREATE TABLE `job_batches` (
  `id` varchar(255) NOT NULL,
  `name` varchar(255) NOT NULL,
  `total_jobs` int(11) NOT NULL,
  `pending_jobs` int(11) NOT NULL,
  `failed_jobs` int(11) NOT NULL,
  `failed_job_ids` longtext NOT NULL,
  `options` mediumtext DEFAULT NULL,
  `cancelled_at` int(11) DEFAULT NULL,
  `created_at` int(11) NOT NULL,
  `finished_at` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `ket_qua_thi`
--

CREATE TABLE `ket_qua_thi` (
  `maKQT` bigint(20) UNSIGNED NOT NULL,
  `maTK` bigint(20) UNSIGNED NOT NULL,
  `maDT` bigint(20) UNSIGNED NOT NULL,
  `diemSo` double NOT NULL,
  `tongSoCau` int(11) NOT NULL,
  `soCauDung` int(11) NOT NULL,
  `ngayThi` datetime DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `ket_qua_thi`
--

INSERT INTO `ket_qua_thi` (`maKQT`, `maTK`, `maDT`, `diemSo`, `tongSoCau`, `soCauDung`, `ngayThi`, `created_at`, `updated_at`) VALUES
(1, 5, 2, 7.5, 20, 15, '2025-07-10 14:00:00', '2025-07-10 08:00:00', '2025-07-10 08:00:00'),
(2, 6, 2, 8.5, 20, 17, '2025-07-10 14:00:00', '2025-07-10 08:00:00', '2025-07-10 08:00:00');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `ky_thi`
--

CREATE TABLE `ky_thi` (
  `maKT` bigint(20) UNSIGNED NOT NULL,
  `tenKT` varchar(255) DEFAULT NULL,
  `moTa` text DEFAULT NULL,
  `ngayThi` datetime DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `ky_thi`
--

INSERT INTO `ky_thi` (`maKT`, `tenKT`, `moTa`, `ngayThi`, `created_at`, `updated_at`) VALUES
(1, 'Giữa kỳ Cơ sở dữ liệu', 'Thi giữa kỳ môn Cơ sở dữ liệu', '2025-06-25 09:00:00', '2025-07-06 18:26:27', '2025-07-06 18:26:27'),
(2, 'Cuối kỳ Cơ sở dữ liệu', 'Thi cuối kỳ môn Cơ sở dữ liệu', '2025-07-10 14:00:00', '2025-07-06 18:26:27', '2025-07-06 18:26:27'),
(3, 'Giữa kỳ Lập trình hướng đối tượng', 'Thi giữa kỳ môn Lập trình hướng đối tượng', '2025-07-13 09:00:00', '2025-07-06 18:26:52', '2025-07-06 18:26:52'),
(4, 'Cuối kỳ Lập trình hướng đối tượng', 'Thi cuối kỳ môn Lập trình hướng đối tượng', '2025-07-13 14:00:00', '2025-07-06 18:26:52', '2025-07-06 18:26:52'),
(5, 'Giữa kỳ Lập trình Python', 'Thi giữa kỳ môn Lập trình Python', '2025-07-22 09:00:00', '2025-07-06 18:27:09', '2025-07-06 18:27:09'),
(6, 'Cuối kỳ Lập trình Python', 'Thi cuối kỳ môn Lập trình Python', '2025-07-31 14:00:00', '2025-07-06 18:27:09', '2025-07-06 18:27:09');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '0001_01_01_000000_create_users_table', 1),
(2, '0001_01_01_000001_create_cache_table', 1),
(3, '0001_01_01_000002_create_jobs_table', 1),
(4, '2025_06_08_084113_create_phan_quyen_table', 1),
(5, '2025_06_08_084256_create_tai_khoan_table', 1),
(6, '2025_06_08_084401_create_mon_hoc_table', 1),
(7, '2025_06_08_084439_create_de_thi_table', 1),
(8, '2025_06_08_084527_create_cau_hoi_table', 1),
(9, '2025_06_08_084653_create_ky_thi_table', 1),
(10, '2025_06_08_084736_create_chi_tiet_de_thi_table', 1),
(11, '2025_06_08_084815_create_ket_qua_thi_table', 1),
(12, '2025_06_08_084852_create_bai_lam_table', 1),
(13, '2025_06_09_092501_add_tenkt_to_ky_thi_table', 2),
(14, '2025_06_18_114822_create_chi_tiet_ky_thi_table', 3),
(15, '2025_06_18_121131_remove_ma_d_t_from_ky_thi_table', 4),
(16, '2025_06_21_114349_remove_mactdt_from_chi_tiet_de_thi_table', 5),
(17, '2025_06_23_020133_remove_ma_p_q_and_cap_quyen_from_tai_khoan_table', 6),
(18, '2025_06_23_020427_create_phan_quyen_tai_khoan_table', 7),
(19, '2025_06_26_160321_create_chuong_table', 8),
(20, '2025_06_26_160439_add_ma_chuong_to_cau_hoi_table', 9),
(21, '2025_06_30_201305_create_quan_ly_thi_table', 10),
(22, '2025_06_30_212033_add_ma_kt_to_de_thi_table', 11);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `mon_hoc`
--

CREATE TABLE `mon_hoc` (
  `maMH` bigint(20) UNSIGNED NOT NULL,
  `tenMH` varchar(50) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `mon_hoc`
--

INSERT INTO `mon_hoc` (`maMH`, `tenMH`, `created_at`, `updated_at`) VALUES
(1, 'Cơ sở dữ liệu', '2025-07-06 17:40:47', '2025-07-06 17:40:47'),
(2, 'Lập trình hướng đối tượng', '2025-07-06 17:40:47', '2025-07-06 17:40:47'),
(3, 'Lập trình Python', '2025-07-06 17:40:47', '2025-07-06 17:40:47');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `nhan_xet`
--

CREATE TABLE `nhan_xet` (
  `maNX` bigint(20) UNSIGNED NOT NULL,
  `maTK` bigint(20) UNSIGNED NOT NULL,
  `maDT` bigint(20) UNSIGNED DEFAULT NULL,
  `noiDung` text NOT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `nhan_xet`
--

INSERT INTO `nhan_xet` (`maNX`, `maTK`, `maDT`, `noiDung`, `created_at`, `updated_at`) VALUES
(1, 5, 2, 'Đề thi phù hợp với kiến thức đã học, câu hỏi rõ ràng và không đánh đố. Thời gian làm bài hợp lý, đủ để hoàn thành toàn bộ câu hỏi. Một số câu hỏi ở mức nâng cao giúp phân loại được năng lực sinh viên.', '2025-07-06 19:29:09', '2025-07-06 19:29:09');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `password_reset_tokens`
--

CREATE TABLE `password_reset_tokens` (
  `email` varchar(255) NOT NULL,
  `token` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `quan_ly_thi`
--

CREATE TABLE `quan_ly_thi` (
  `maKT` bigint(20) UNSIGNED NOT NULL,
  `maTK` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `quan_ly_thi`
--

INSERT INTO `quan_ly_thi` (`maKT`, `maTK`, `created_at`, `updated_at`) VALUES
(1, 5, '2025-07-06 18:45:58', '2025-07-06 18:45:58'),
(1, 6, '2025-07-06 18:45:58', '2025-07-06 18:45:58'),
(1, 7, '2025-07-06 18:45:58', '2025-07-06 18:45:58'),
(2, 5, '2025-07-06 18:46:10', '2025-07-06 18:46:10'),
(2, 6, '2025-07-06 18:46:10', '2025-07-06 18:46:10'),
(2, 8, '2025-07-06 18:46:10', '2025-07-06 18:46:10'),
(3, 7, '2025-07-06 18:46:24', '2025-07-06 18:46:24'),
(3, 8, '2025-07-06 18:46:24', '2025-07-06 18:46:24'),
(3, 9, '2025-07-06 18:46:24', '2025-07-06 18:46:24'),
(4, 7, '2025-07-06 18:46:40', '2025-07-06 18:46:40'),
(4, 8, '2025-07-06 18:46:40', '2025-07-06 18:46:40'),
(4, 10, '2025-07-06 18:46:40', '2025-07-06 18:46:40'),
(5, 5, '2025-07-06 18:46:56', '2025-07-06 18:46:56'),
(5, 9, '2025-07-06 18:46:56', '2025-07-06 18:46:56'),
(5, 10, '2025-07-06 18:46:56', '2025-07-06 18:46:56'),
(6, 6, '2025-07-06 18:47:09', '2025-07-06 18:47:09'),
(6, 9, '2025-07-06 18:47:09', '2025-07-06 18:47:09'),
(6, 10, '2025-07-06 18:47:09', '2025-07-06 18:47:09');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `sessions`
--

CREATE TABLE `sessions` (
  `id` varchar(255) NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `ip_address` varchar(45) DEFAULT NULL,
  `user_agent` text DEFAULT NULL,
  `payload` longtext NOT NULL,
  `last_activity` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `sessions`
--

INSERT INTO `sessions` (`id`, `user_id`, `ip_address`, `user_agent`, `payload`, `last_activity`) VALUES
('7ZGBiR4IWj4XCsKaXq8NmQXMTzYs8dWSlRg4snoX', NULL, '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/146.0.0.0 Safari/537.36', 'YTozOntzOjk6Il9wcmV2aW91cyI7YToxOntzOjM6InVybCI7czoyNzoiaHR0cDovLzEyNy4wLjAuMTo4MDAwL2xvZ2luIjt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319czo2OiJfdG9rZW4iO3M6NDA6ImhWdjNxWnczcXBwY0Jsd0VsQlMybXNDd2d1N2hqMVdPUk1La2hUU3giO30=', 1775483852),
('bYtsWKcfjZMKpNZEOIkjYWT4JXsp8EOIqfGZ5VtC', NULL, '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/138.0.0.0 Safari/537.36', 'YTozOntzOjk6Il9wcmV2aW91cyI7YToxOntzOjM6InVybCI7czoyNzoiaHR0cDovLzEyNy4wLjAuMTo4MDAwL2xvZ2luIjt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319czo2OiJfdG9rZW4iO3M6NDA6IldOaVhiSGxUM2FIMHd0dUpUZzhuc2ljc0tQZ3lOblRWSVgyTlNUalAiO30=', 1752692892),
('ro5xWY51KGRWfoCADb8g33pZSqfYVJUbP1YsAIfm', NULL, '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/146.0.0.0 Safari/537.36', 'YTozOntzOjk6Il9wcmV2aW91cyI7YToxOntzOjM6InVybCI7czoyNzoiaHR0cDovLzEyNy4wLjAuMTo4MDAwL2xvZ2luIjt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319czo2OiJfdG9rZW4iO3M6NDA6InQ3WEU2d0V1b1BJSjhnb0RCNkMyYkxDVWpFQkFiQ3RhU0tXM1NNUkYiO30=', 1774105369);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `tai_khoan`
--

CREATE TABLE `tai_khoan` (
  `maTK` bigint(20) UNSIGNED NOT NULL,
  `email` varchar(50) NOT NULL,
  `matKhau` varchar(255) NOT NULL,
  `hoTen` varchar(255) NOT NULL,
  `anhDaiDien` varchar(255) DEFAULT NULL,
  `vaiTro` enum('quanTri','giangVien','sinhVien') NOT NULL,
  `doiMK` tinyint(1) NOT NULL DEFAULT 0,
  `ngayTao` datetime DEFAULT NULL,
  `last_seen_de_thi_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `tai_khoan`
--

INSERT INTO `tai_khoan` (`maTK`, `email`, `matKhau`, `hoTen`, `anhDaiDien`, `vaiTro`, `doiMK`, `ngayTao`, `last_seen_de_thi_at`, `created_at`, `updated_at`) VALUES
(1, 'hung.nguyen@caothang.edu.vn', '$2y$12$WFf/Olo.RvwvMoXVGKRfhero783j299JLQdoLXKmovBfDL9WCzwsu', 'Nguyễn Văn Hùng', NULL, 'quanTri', 0, '2025-06-23 20:05:58', NULL, '2025-06-23 13:05:58', '2025-06-23 18:31:42'),
(2, 'nga.le@caothang.edu.vn', '$2y$12$qoL10apo4RC18mWcjmeCZunJLomAawuE9Vc24teyNBLLA7dLC1sz2', 'Lê Thị Nga', NULL, 'giangVien', 0, '2025-06-23 20:05:58', NULL, '2025-06-23 13:05:58', '2025-07-04 02:08:57'),
(3, 'kien.phan@caothang.edu.vn', '$2y$12$x27XQY0JT.dg3dvzWd2C2e/Jze3mCZGmGA1CUE5lvknzHg1IpJKx2', 'Phan Tấn Kiên', NULL, 'giangVien', 0, '2025-06-23 20:05:58', NULL, '2025-06-23 13:05:58', '2025-06-23 13:05:58'),
(4, 'dung.nguyen@caothang.edu.vn', '$2y$12$1Iqd4v9xeJxWRh2/D7g/NOF1fZjlhnACBF7oZmwJ3a.wiVH3oPYaS', 'Nguyễn Hữu Dũng', NULL, 'giangVien', 0, '2025-06-23 20:05:58', NULL, '2025-06-23 13:05:58', '2025-07-06 12:51:58'),
(5, 'mai.pham@caothang.edu.vn', '$2y$12$x27XQY0JT.dg3dvzWd2C2e/Jze3mCZGmGA1CUE5lvknzHg1IpJKx2', 'Phạm Thị Mai', NULL, 'sinhVien', 0, '2025-06-23 20:05:58', NULL, '2025-06-23 13:05:58', '2025-07-06 19:11:07'),
(6, 'tuan.tran@caothang.edu.vn', '$2y$12$x27XQY0JT.dg3dvzWd2C2e/Jze3mCZGmGA1CUE5lvknzHg1IpJKx2', 'Trần Anh Tuấn', NULL, 'sinhVien', 0, '2025-06-23 20:05:58', '2026-04-06 13:56:30', '2025-06-23 13:05:58', '2026-04-06 13:56:30'),
(7, 'huong.le@caothang.edu.vn', '$2y$12$x27XQY0JT.dg3dvzWd2C2e/Jze3mCZGmGA1CUE5lvknzHg1IpJKx2', 'Lê Ngọc Hương', NULL, 'sinhVien', 0, '2025-06-23 20:05:58', NULL, '2025-06-23 13:05:58', '2025-06-23 13:05:58'),
(8, 'bao.vo@caothang.edu.vn', '$2y$12$x27XQY0JT.dg3dvzWd2C2e/Jze3mCZGmGA1CUE5lvknzHg1IpJKx2', 'Võ Hoàng Bảo', NULL, 'sinhVien', 0, '2025-06-23 20:05:58', NULL, '2025-06-23 13:05:58', '2025-06-23 13:05:58'),
(9, 'hien.nguyen@caothang.edu.vn', '$2y$12$x27XQY0JT.dg3dvzWd2C2e/Jze3mCZGmGA1CUE5lvknzHg1IpJKx2', 'Nguyễn Thị Hiền', NULL, 'sinhVien', 0, '2025-06-23 20:05:58', NULL, '2025-06-23 13:05:58', '2025-06-23 13:05:58'),
(10, 'tam.dang@caothang.edu.vn', '$2y$12$x27XQY0JT.dg3dvzWd2C2e/Jze3mCZGmGA1CUE5lvknzHg1IpJKx2', 'Đặng Gia Tâm', NULL, 'sinhVien', 0, '2025-06-23 20:05:58', NULL, '2025-06-23 13:05:58', '2025-06-23 13:05:58');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) NOT NULL,
  `remember_token` varchar(100) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Chỉ mục cho các bảng đã đổ
--

--
-- Chỉ mục cho bảng `bai_lam`
--
ALTER TABLE `bai_lam`
  ADD PRIMARY KEY (`maBL`),
  ADD KEY `bai_lam_matk_foreign` (`maTK`),
  ADD KEY `bai_lam_makqt_foreign` (`maKQT`),
  ADD KEY `bai_lam_madt_foreign` (`maDT`);

--
-- Chỉ mục cho bảng `cache`
--
ALTER TABLE `cache`
  ADD PRIMARY KEY (`key`);

--
-- Chỉ mục cho bảng `cache_locks`
--
ALTER TABLE `cache_locks`
  ADD PRIMARY KEY (`key`);

--
-- Chỉ mục cho bảng `cau_hoi`
--
ALTER TABLE `cau_hoi`
  ADD PRIMARY KEY (`maCH`),
  ADD KEY `cau_hoi_manguoitao_foreign` (`maNguoiTao`),
  ADD KEY `cau_hoi_mamonhoc_foreign` (`maMonHoc`),
  ADD KEY `cau_hoi_machuong_foreign` (`maChuong`);

--
-- Chỉ mục cho bảng `chi_tiet_bai_lam`
--
ALTER TABLE `chi_tiet_bai_lam`
  ADD KEY `chi_tiet_bai_lam_mabl_foreign` (`maBL`),
  ADD KEY `chi_tiet_bai_lam_mach_foreign` (`maCH`);

--
-- Chỉ mục cho bảng `chi_tiet_de_thi`
--
ALTER TABLE `chi_tiet_de_thi`
  ADD KEY `chi_tiet_de_thi_madt_foreign` (`maDT`),
  ADD KEY `chi_tiet_de_thi_mach_foreign` (`maCH`);

--
-- Chỉ mục cho bảng `chuong`
--
ALTER TABLE `chuong`
  ADD PRIMARY KEY (`maChuong`),
  ADD KEY `chuong_mamh_foreign` (`maMH`);

--
-- Chỉ mục cho bảng `de_thi`
--
ALTER TABLE `de_thi`
  ADD PRIMARY KEY (`maDT`),
  ADD KEY `de_thi_matk_foreign` (`maTK`),
  ADD KEY `de_thi_mamh_foreign` (`maMH`),
  ADD KEY `de_thi_makt_foreign` (`maKT`);

--
-- Chỉ mục cho bảng `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Chỉ mục cho bảng `jobs`
--
ALTER TABLE `jobs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `jobs_queue_index` (`queue`);

--
-- Chỉ mục cho bảng `job_batches`
--
ALTER TABLE `job_batches`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `ket_qua_thi`
--
ALTER TABLE `ket_qua_thi`
  ADD PRIMARY KEY (`maKQT`),
  ADD KEY `ket_qua_thi_matk_foreign` (`maTK`),
  ADD KEY `ket_qua_thi_madt_foreign` (`maDT`);

--
-- Chỉ mục cho bảng `ky_thi`
--
ALTER TABLE `ky_thi`
  ADD PRIMARY KEY (`maKT`);

--
-- Chỉ mục cho bảng `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `mon_hoc`
--
ALTER TABLE `mon_hoc`
  ADD PRIMARY KEY (`maMH`);

--
-- Chỉ mục cho bảng `nhan_xet`
--
ALTER TABLE `nhan_xet`
  ADD PRIMARY KEY (`maNX`),
  ADD KEY `nhan_xet_matk_foreign` (`maTK`),
  ADD KEY `nhan_xet_madt_foreign` (`maDT`);

--
-- Chỉ mục cho bảng `password_reset_tokens`
--
ALTER TABLE `password_reset_tokens`
  ADD PRIMARY KEY (`email`);

--
-- Chỉ mục cho bảng `quan_ly_thi`
--
ALTER TABLE `quan_ly_thi`
  ADD KEY `quan_ly_thi_makt_foreign` (`maKT`),
  ADD KEY `quan_ly_thi_matk_foreign` (`maTK`);

--
-- Chỉ mục cho bảng `sessions`
--
ALTER TABLE `sessions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `sessions_user_id_index` (`user_id`),
  ADD KEY `sessions_last_activity_index` (`last_activity`);

--
-- Chỉ mục cho bảng `tai_khoan`
--
ALTER TABLE `tai_khoan`
  ADD PRIMARY KEY (`maTK`);

--
-- Chỉ mục cho bảng `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- AUTO_INCREMENT cho các bảng đã đổ
--

--
-- AUTO_INCREMENT cho bảng `bai_lam`
--
ALTER TABLE `bai_lam`
  MODIFY `maBL` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT cho bảng `cau_hoi`
--
ALTER TABLE `cau_hoi`
  MODIFY `maCH` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=155;

--
-- AUTO_INCREMENT cho bảng `chuong`
--
ALTER TABLE `chuong`
  MODIFY `maChuong` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT cho bảng `de_thi`
--
ALTER TABLE `de_thi`
  MODIFY `maDT` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT cho bảng `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT cho bảng `jobs`
--
ALTER TABLE `jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT cho bảng `ket_qua_thi`
--
ALTER TABLE `ket_qua_thi`
  MODIFY `maKQT` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT cho bảng `ky_thi`
--
ALTER TABLE `ky_thi`
  MODIFY `maKT` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT cho bảng `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT cho bảng `mon_hoc`
--
ALTER TABLE `mon_hoc`
  MODIFY `maMH` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT cho bảng `nhan_xet`
--
ALTER TABLE `nhan_xet`
  MODIFY `maNX` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT cho bảng `tai_khoan`
--
ALTER TABLE `tai_khoan`
  MODIFY `maTK` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT cho bảng `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- Các ràng buộc cho các bảng đã đổ
--

--
-- Các ràng buộc cho bảng `bai_lam`
--
ALTER TABLE `bai_lam`
  ADD CONSTRAINT `bai_lam_madt_foreign` FOREIGN KEY (`maDT`) REFERENCES `de_thi` (`maDT`) ON DELETE CASCADE,
  ADD CONSTRAINT `bai_lam_makqt_foreign` FOREIGN KEY (`maKQT`) REFERENCES `ket_qua_thi` (`maKQT`) ON DELETE CASCADE,
  ADD CONSTRAINT `bai_lam_matk_foreign` FOREIGN KEY (`maTK`) REFERENCES `tai_khoan` (`maTK`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `cau_hoi`
--
ALTER TABLE `cau_hoi`
  ADD CONSTRAINT `cau_hoi_machuong_foreign` FOREIGN KEY (`maChuong`) REFERENCES `chuong` (`maChuong`) ON DELETE SET NULL,
  ADD CONSTRAINT `cau_hoi_mamonhoc_foreign` FOREIGN KEY (`maMonHoc`) REFERENCES `mon_hoc` (`maMH`) ON DELETE CASCADE,
  ADD CONSTRAINT `cau_hoi_manguoitao_foreign` FOREIGN KEY (`maNguoiTao`) REFERENCES `tai_khoan` (`maTK`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `chi_tiet_bai_lam`
--
ALTER TABLE `chi_tiet_bai_lam`
  ADD CONSTRAINT `chi_tiet_bai_lam_mabl_foreign` FOREIGN KEY (`maBL`) REFERENCES `bai_lam` (`maBL`) ON DELETE CASCADE,
  ADD CONSTRAINT `chi_tiet_bai_lam_mach_foreign` FOREIGN KEY (`maCH`) REFERENCES `cau_hoi` (`maCH`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `chi_tiet_de_thi`
--
ALTER TABLE `chi_tiet_de_thi`
  ADD CONSTRAINT `chi_tiet_de_thi_mach_foreign` FOREIGN KEY (`maCH`) REFERENCES `cau_hoi` (`maCH`) ON DELETE CASCADE,
  ADD CONSTRAINT `chi_tiet_de_thi_madt_foreign` FOREIGN KEY (`maDT`) REFERENCES `de_thi` (`maDT`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `chuong`
--
ALTER TABLE `chuong`
  ADD CONSTRAINT `chuong_mamh_foreign` FOREIGN KEY (`maMH`) REFERENCES `mon_hoc` (`maMH`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `de_thi`
--
ALTER TABLE `de_thi`
  ADD CONSTRAINT `de_thi_makt_foreign` FOREIGN KEY (`maKT`) REFERENCES `ky_thi` (`maKT`) ON DELETE SET NULL,
  ADD CONSTRAINT `de_thi_mamh_foreign` FOREIGN KEY (`maMH`) REFERENCES `mon_hoc` (`maMH`) ON DELETE CASCADE,
  ADD CONSTRAINT `de_thi_matk_foreign` FOREIGN KEY (`maTK`) REFERENCES `tai_khoan` (`maTK`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `ket_qua_thi`
--
ALTER TABLE `ket_qua_thi`
  ADD CONSTRAINT `ket_qua_thi_madt_foreign` FOREIGN KEY (`maDT`) REFERENCES `de_thi` (`maDT`) ON DELETE CASCADE,
  ADD CONSTRAINT `ket_qua_thi_matk_foreign` FOREIGN KEY (`maTK`) REFERENCES `tai_khoan` (`maTK`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `nhan_xet`
--
ALTER TABLE `nhan_xet`
  ADD CONSTRAINT `nhan_xet_madt_foreign` FOREIGN KEY (`maDT`) REFERENCES `de_thi` (`maDT`) ON DELETE SET NULL,
  ADD CONSTRAINT `nhan_xet_matk_foreign` FOREIGN KEY (`maTK`) REFERENCES `tai_khoan` (`maTK`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `quan_ly_thi`
--
ALTER TABLE `quan_ly_thi`
  ADD CONSTRAINT `quan_ly_thi_makt_foreign` FOREIGN KEY (`maKT`) REFERENCES `ky_thi` (`maKT`) ON DELETE CASCADE,
  ADD CONSTRAINT `quan_ly_thi_matk_foreign` FOREIGN KEY (`maTK`) REFERENCES `tai_khoan` (`maTK`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
